posts.org
#+hugo_base_dir: .
#+hugo_section: posts
** TODO Podcasts
:PROPERTIES:
:EXPORT_FILE_NAME: podcasts
:END:
List of podcasts I listen to.
music i listen to

*** Post with YAML front-matter
:PROPERTIES:
:EXPORT_FILE_NAME: extra-front-matter-yaml
:EXPORT_HUGO_FRONT_MATTER_FORMAT: yaml
:END:
The contents of the ~#+begin_src yaml :front_matter_extra t~ YAML
block here will get appended to the YAML front-matter.
#+begin_src yaml :front_matter_extra t
    resources:
      - name: old_man_writing
  src: "old_man_writing.jpg"
  params:
  description: "dsdad"
#+end_src

*** Post with TOML front-matter (default)
:PROPERTIES:
:EXPORT_FILE_NAME: extra-front-matter-toml
:END:
resources:
- name: featuredImage
  src: "grandCanyonDescent.jpeg"
  params:
    description: "Walking down the grand canyon trail.  Lots of lense flair."

The contents of the ~#+begin_src toml :front_matter_extra t~ TOML
block here will get appended to the TOML front-matter.
#+begin_src toml :front_matter_extra t
#+end_src
