content/lists/podcasts.md
+++
title = "Podcasts"
author = ["Aidin Biibosunov"]
categories = ["lists"]
draft = true

+++

List of podcasts I listen to.
music i listen to


## Post with YAML front-matter {#post-with-yaml-front-matter}

The contents of the `#+begin_src yaml :front_matter_extra t` YAML
block here will get appended to the YAML front-matter.


## Post with TOML front-matter (default) {#post-with-toml-front-matter--default}

resources:

-   name: featuredImage
    src: "grandCanyonDescent.jpeg"
    params:
      description: "Walking down the grand canyon trail.  Lots of lense flair."

The contents of the `#+begin_src toml :front_matter_extra t` TOML
block here will get appended to the TOML front-matter.
